# Pandas Introduction

Source code for pandas: Introduction to pandas data structures lecture slides

First, import numpy and pandas

In [3]:
import pandas as pd  # module for data analysis
import numpy as np  # module for efficient computations


pd.set_option('max_columns', 50)

## Series

Create a simple Series object wit an index

In [2]:
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'],
              index=['A', 'Z', 'C', 'Y', 'E'])
print(s)

A                7
Z       Heisenberg
C             3.14
Y      -1789710578
E    Happy Eating!
dtype: object

Convert dictionary to a Series

In [4]:
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
cities = pd.Series(d)
print(cities)

Austin            450.0
Boston              NaN
Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
dtype: float64

Accessing Series' elements by index

In [5]:
print(cities['Chicago'])
print('\n')
print(cities[['Chicago', 'Portland', 'San Francisco']])

1000.0


Chicago          1000.0
Portland          900.0
San Francisco    1100.0
dtype: float64

Selecting elements of Series using a boolean index

In [6]:
print(cities[cities < 1000])

Austin      450.0
Portland    900.0
dtype: float64

Let's examine the created boolean index

In [7]:
less_than_1000 = cities < 1000
less_than_1000

Austin            True
Boston           False
Chicago          False
New York         False
Portland          True
San Francisco    False
dtype: bool

Applying boolean index to a series filters out all elements, which boolean index is set to `False`

In [8]:
print(cities[less_than_1000])

Austin      450.0
Portland    900.0
dtype: float64

Editing Series' elements based on the index

In [9]:
print('Old value:', cities['Chicago'])
cities['Chicago'] = 1400
print('New value:', cities['Chicago'])

Old value: 1000.0
New value: 1400.0

Editing Series' elements using boolean logic

In [10]:
cities[cities < 1000]

Austin      450.0
Portland    900.0
dtype: float64

In [11]:
cities[cities < 1000] = 750
cities[cities < 1000]

Austin      750.0
Portland    750.0
dtype: float64

Test for element's membership in a Series

In [12]:
print('Seattle' in cities)
print('San Francisco' in cities)

False
True

Mathematical operations on elements of Series

In [13]:
print(cities / 3)
print('\n')
print(np.square(cities))

Austin           250.000000
Boston                  NaN
Chicago          466.666667
New York         433.333333
Portland         250.000000
San Francisco    366.666667
dtype: float64


Austin            562500.0
Boston                 NaN
Chicago          1960000.0
New York         1690000.0
Portland          562500.0
San Francisco    1210000.0
dtype: float64

Mathematical operations on Series

In [14]:
cities[['Chicago', 'New York']]

Chicago     1400.0
New York    1300.0
dtype: float64

In [15]:
cities[['Austin', 'New York']]

Austin       750.0
New York    1300.0
dtype: float64

In [16]:
cities[['Chicago', 'New York']] + cities[['Austin', 'New York']]

Austin         NaN
Chicago        NaN
New York    2600.0
dtype: float64

## DataFrame

Creating DataFrame from a dictionary

In [17]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

Creating DataFrame from a CSV file

In [18]:
url = 'https://raw.githubusercontent.com/evdoks/data_science/' \
      'master/data/fugitives.csv'
from_csv = pd.read_csv(url)
from_csv.head()

,Fugitive,Nationality,Wanted by,Wanted for,Details of reason wanted for,Country believed to be in / Country of capture,Date of Birth,Current Age (approx.),Sex,Status,Details,Year of Interpol operation,Source,Interpol Red Notice Profile,Image
0,Viktoryia TSUNIK,Belarus,Belarus,"Theft, Fraud",Theft by abuse of power,"Angola, Europe, Russia, Ukraine",1961.0,53.0,Female,Free,"Founder of the ""Tsunik"" company in Vitebsk, Be...",2012,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...
1,Adriano GIACOBONE,Italy,Italy,"Kidnapping, Possession of firearms and/or expl...","Kidnapping, illegal detention and carrying of ...","Argentina, France, Morocco, Paraguay, Spain",1957.0,57.0,Male,Free,"Among a series of court judgments, GIACOBONE h...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/1...,http://www.interpol.int/var/interpol/cache/ws/...
2,Sudiman SUNOTO,Indonesia,Indonesia,"Illegal Logging, Environmental Crimes",Illegal logging,Asia,1962.0,52.0,Male,Free,"On 11 November 2006, the Indonesian Criminal I...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...
3,David Macdonald CARROL,Canada,Canada,"Murder, Attempted Murder, Drug Crimes","Murder, Conspiracy to murder, drug trafficking...","Australia, Brazil, Europe, Mexico, New Zealand...",1952.0,62.0,Male,Free,CARROL is a member of the Quebec Nomads Chapte...,"2012, 2010",www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/1...,http://www.interpol.int/var/interpol/cache/ws/...
4,Jason HOLLAND,"United Kingdom, South Africa",South Africa,Fraud,Fraud,"Australia, United Kingdom, The Netherlands",1967.0,47.0,Male,Free,In 2007 HOLLAND was employed as a Financial D...,2010,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...

Creating DataFrame from a subset of columns of CSV file

In [19]:
cols = ['Fugitive', 'Nationality', 'Wanted by']
no_headers = pd.read_csv(url, 
                         sep=',',
                         usecols=cols)
no_headers.head()

                 Fugitive                   Nationality     Wanted by
0        Viktoryia TSUNIK                       Belarus       Belarus
1       Adriano GIACOBONE                         Italy         Italy
2          Sudiman SUNOTO                     Indonesia     Indonesia
3  David Macdonald CARROL                        Canada        Canada
4           Jason HOLLAND  United Kingdom, South Africa  South Africa


Creating DataFrame from CSV data in clipboard: copy a fragment of https://raw.githubusercontent.com/evdoks/data_science/master/data/fugitives.csv into clpiboard

In [20]:
foo = pd.read_clipboard(sep=',')
foo.head()

,Fugitive,Nationality,Wanted by,Wanted for,Details of reason wanted for,Country believed to be in / Country of capture,Date of Birth,Current Age (approx.),Sex,Status,Details,Year of Interpol operation,Source,Interpol Red Notice Profile,Image
0,Viktoryia TSUNIK,Belarus,Belarus,"Theft, Fraud",Theft by abuse of power,"Angola, Europe, Russia, Ukraine",1961.0,53.0,Female,Free,"Founder of the ""Tsunik"" company in Vitebsk, Be...",2012,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...
1,Adriano GIACOBONE,Italy,Italy,"Kidnapping, Possession of firearms and/or expl...","Kidnapping, illegal detention and carrying of ...","Argentina, France, Morocco, Paraguay, Spain",1957.0,57.0,Male,Free,"Among a series of court judgments, GIACOBONE h...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/1...,http://www.interpol.int/var/interpol/cache/ws/...
2,Sudiman SUNOTO,Indonesia,Indonesia,"Illegal Logging, Environmental Crimes",Illegal logging,Asia,1962.0,52.0,Male,Free,"On 11 November 2006, the Indonesian Criminal I...",2014,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...
3,David Macdonald CARROL,Canada,Canada,"Murder, Attempted Murder, Drug Crimes","Murder, Conspiracy to murder, drug trafficking...","Australia, Brazil, Europe, Mexico, New Zealand...",1952.0,62.0,Male,Free,CARROL is a member of the Quebec Nomads Chapte...,"2012, 2010",www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/1...,http://www.interpol.int/var/interpol/cache/ws/...
4,Jason HOLLAND,"United Kingdom, South Africa",South Africa,Fraud,Fraud,"Australia, United Kingdom, The Netherlands",1967.0,47.0,Male,Free,In 2007 HOLLAND was employed as a Financial D...,2010,www.interpol.int/Media/Files/Crime-areas/Fugit...,http://www.interpol.int/notice/search/wanted/2...,http://www.interpol.int/var/interpol/cache/ws/...

Saving DataFrame as CSV file

In [21]:
no_headers.to_csv('~/fugitives_brief.csv')

### Exploring DataFrames with MovieLens Dataset

Loading MovieLens 100k into DataFrames

In [24]:
# pass in column names for each CSV
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
users = pd.read_csv('https://raw.githubusercontent.com/evdoks/data_science/'
                    'master/data/ml-100k/u.user', sep='|', names=u_cols,
                    encoding='latin-1')

r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('https://raw.githubusercontent.com/evdoks/data_science/'
                      'master/data/ml-100k/u.data', sep='\t', names=r_cols,
                      encoding='latin-1')

# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 
          'imdb_url']
movies = pd.read_csv('https://raw.githubusercontent.com/evdoks/data_science/'
                     'master/data/ml-100k/u.item', sep='|', names=m_cols, 
                     usecols=range(5), encoding='latin-1')

Inspection of `DataFrame`

In [25]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 5 columns):
movie_id              1682 non-null int64
title                 1682 non-null object
release_date          1681 non-null object
video_release_date    0 non-null float64
imdb_url              1679 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 65.8+ KB

In [26]:
movies.dtypes

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

In [27]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

Selecting columns of `DataFrame`

In [28]:
users['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

In [29]:
users[['age', 'zip_code']].head()

   age zip_code
0   24    85711
1   53    94043
2   23    32067
3   24    43537
4   33    15213

Storing column names in a variable

In [30]:
columns_you_want = ['occupation', 'sex'] 
users[columns_you_want].head()

   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

Selecting rows of `DataFrame` based on a condition

In [31]:
# users older than 25
users[users.age > 25].head(3)

   user_id  age sex occupation zip_code
1        2   53   F      other    94043
4        5   33   F      other    15213
5        6   42   M  executive    98101

In [32]:
# users aged 40 AND male
users[(users.age == 40) & (users.sex == 'M')].head(3)

     user_id  age sex  occupation zip_code
18        19   40   M   librarian    02138
82        83   40   M       other    44133
115      116   40   M  healthcare    97232

In [33]:
users[(users.sex == 'F') | (users.age < 30)].head(3)

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067

Reindexing of `DataFrame`

Reindexing does not change the original dataframe

In [34]:
users.set_index('user_id').head()
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

`set_index` actually returns a new DataFrame

In [35]:
with_new_index = users.set_index('user_id')
with_new_index.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

Use `inplace` to modify an existing DataFrame

In [36]:
users.set_index('user_id', inplace=True)
users.head()

         age sex  occupation zip_code
user_id
1         24   M  technician    85711
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213

Selecting rows of `DataFrame` by position

In [37]:
users.iloc[99]

age                  36
sex                   M
occupation    executive
zip_code          90254
Name: 100, dtype: object

In [38]:
users.iloc[[1, 50, 300]]

         age sex occupation zip_code
user_id
2         53   F      other    94043
51        28   M   educator    16509
301       24   M    student    55439

Selecting rows of `DataFrame` by index label

In [39]:
users.loc[100]

age                  36
sex                   M
occupation    executive
zip_code          90254
Name: 100, dtype: object

In [40]:
users.loc[[2, 51, 301]]

         age sex occupation zip_code
user_id
2         53   F      other    94043
51        28   M   educator    16509
301       24   M    student    55439

Resetting index of `DataFrame`

In [41]:
users.reset_index(inplace=True)
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

### Merging (joining) DataFrames

Creating `DataFrames`

In [42]:
df_employee = pd.DataFrame(
{'LastName': ['Rafferty', 'Jones', 'Heisenberg', 'Robinson', 
      'Smith', 'Williams'],
'DepartmentId': [31, 33, 33, 34, 34, np.nan]
})

df_department = pd.DataFrame(
  {'DepartmentName': ['Sales', 'Engineering', 'Clerical', 
   'Marketing']}, 
  index = [31, 33, 34, 35]
)

Inner join

In [43]:
pd.merge(df_employee, df_department, left_on='DepartmentId',
         right_index=True, how='inner')

  DepartmentId    LastName DepartmentName
0           31    Rafferty          Sales
1           33       Jones    Engineering
2           33  Heisenberg    Engineering
3           34    Robinson       Clerical
4           34       Smith       Clerical

Left outer join

In [44]:
pd.merge(df_employee, df_department, left_on='DepartmentId',
         right_index=True, how='left')

  DepartmentId    LastName DepartmentName
0           31    Rafferty          Sales
1           33       Jones    Engineering
2           33  Heisenberg    Engineering
3           34    Robinson       Clerical
4           34       Smith       Clerical
5          NaN    Williams            NaN

Right outer join

In [45]:
pd.merge(df_employee, df_department, left_on='DepartmentId',
right_index=True, how='right')

   DepartmentId    LastName DepartmentName
0          31.0    Rafferty          Sales
1          33.0       Jones    Engineering
2          33.0  Heisenberg    Engineering
3          34.0    Robinson       Clerical
4          34.0       Smith       Clerical
5          35.0         NaN      Marketing

Full outer join

In [46]:
pd.merge(df_employee, df_department, left_on='DepartmentId',
         right_index=True, how='outer')

   DepartmentId    LastName DepartmentName
0          31.0    Rafferty          Sales
1          33.0       Jones    Engineering
2          33.0  Heisenberg    Engineering
3          34.0    Robinson       Clerical
4          34.0       Smith       Clerical
5           NaN    Williams            NaN
5          35.0         NaN      Marketing

Combining DataFrames

In [47]:
df_employee_1 = pd.DataFrame(
            {'LastName': ['Guenther', 'Schulz'],  
             'DepartmentId': [31, 33]} 
        )
pd.concat([df_employee, df_employee_1])

   DepartmentId    LastName
0          31.0    Rafferty
1          33.0       Jones
2          33.0  Heisenberg
3          34.0    Robinson
4          34.0       Smith
5           NaN    Williams
0          31.0    Guenther
1          33.0      Schulz

In [49]:
pd.concat([df_employee, df_department])

    DepartmentId DepartmentName    LastName
0           31.0            NaN    Rafferty
1           33.0            NaN       Jones
2           33.0            NaN  Heisenberg
3           34.0            NaN    Robinson
4           34.0            NaN       Smith
5            NaN            NaN    Williams
31           NaN          Sales         NaN
33           NaN    Engineering         NaN
34           NaN       Clerical         NaN
35           NaN      Marketing         NaN

### Grouping and aggregating DataFrames

Loading City of Chicago dataset

In [50]:
url = 'https://raw.githubusercontent.com/evdoks/data_science/' \
      'master/data/city-of-chicago-salaries.csv'
headers = ['name', 'title', 'department', 'salary']
chicago = pd.read_csv(url, sep=',', header=0, 
                      names=headers, 
                      converters =   
                        {'salary': lambda x: float(x.replace('$', ''))}
                      )
chicago.head()

                    name                     title        department   salary
0        AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT  85512.0
1      AARON,  JEFFERY M            POLICE OFFICER            POLICE  75372.0
2    AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES  80916.0
3    ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  99648.0
4  ABBATACOLA,  ROBERT J       ELECTRICAL MECHANIC          AVIATION  89440.0

Group dataset by a column

by_dept = chicago.groupby('department')
by_dept

Get `NOT NULL` records within each column

In [ ]:
by_dept.count().head()

Get total records for each department

In [ ]:
by_dept.size().head()

 Gwt total salaries of each department

In [ ]:
by_dept.sum()[20:25]

Get average salary of each department

by_dept.mean()[20:25]

Get median salary of each department

In [ ]:
by_dept.median()[20:25]